---
type: MetallicPaint
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 19
tags: [revit-api, class]
---

# MetallicPaint

`Autodesk.Revit.DB.Visual.MetallicPaint` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | MetallicpaintBaseColor | 2018.1 | `public static string MetallicpaintBaseColor { get ; }` |
| Property | MetallicpaintBaseColorByObject | 2018.1 | `public static string MetallicpaintBaseColorByObject { get ; }` |
| Property | MetallicpaintBaseHighlightspread | 2018.1 | `public static string MetallicpaintBaseHighlightspread { get ; }` |
| Property | MetallicpaintFinish | 2018.1 | `public static string MetallicpaintFinish { get ; }` |
| Property | MetallicpaintFinishPeelamount | 2018.1 | `public static string MetallicpaintFinishPeelamount { get ; }` |
| Property | MetallicpaintFlecks | 2018.1 | `public static string MetallicpaintFlecks { get ; }` |
| Property | MetallicpaintFlecksColor | 2018.1 | `public static string MetallicpaintFlecksColor { get ; }` |
| Property | MetallicpaintFlecksColorByObject | 2018.1 | `public static string MetallicpaintFlecksColorByObject { get ; }` |
| Property | MetallicpaintFlecksSize | 2018.1 | `public static string MetallicpaintFlecksSize { get ; }` |
| Property | MetallicpaintPearl | 2018.1 | `public static string MetallicpaintPearl { get ; }` |
| Property | MetallicpaintPearlAmount | 2018.1 | `public static string MetallicpaintPearlAmount { get ; }` |
| Property | MetallicpaintPearlColor | 2018.1 | `public static string MetallicpaintPearlColor { get ; }` |
| Property | MetallicpaintPearlColorByObject | 2018.1 | `public static string MetallicpaintPearlColorByObject { get ; }` |
| Property | MetallicpaintPearlIor | 2018.1 | `public static string MetallicpaintPearlIor { get ; }` |
| Property | MetallicpaintTopcoat | 2018.1 | `public static string MetallicpaintTopcoat { get ; }` |
| Property | MetallicpaintTopcoatFalloff | 2018.1 | `public static string MetallicpaintTopcoatFalloff { get ; }` |
| Property | MetallicpaintTopcoatGlossy | 2018.1 | `public static string MetallicpaintTopcoatGlossy { get ; }` |